eisup_2019_docmng_integration/src/Catalogs/абс_ИТР/абс_ИТР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_ИТР</name>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыИТР</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРазмещения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Инженер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаПроработки</name>
    <type>
      <types>EnumRef.абс_ДетальностьПроработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодазделениеДТР</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяТематика</name>
    <type>
      <types>CatalogRef.абс_РазделыИТР</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуги</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПостановкаЗадачи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаLotus</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаказыOM</name>
    <attributes>
      <name>НомерЗаказаOM</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипУслуги</name>
      <type>
        <types>String</types>
        <types>CatalogRef.абс_ТипыУслуг</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОМ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>xTTK</name>
    <attributes>
      <name>ОрганизацияЗаказчика</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Узлы</name>
    <attributes>
      <name>Узел</name>
      <type>
        <types>CatalogRef.абс_Узлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ИзменениеСтатусовИТР/абс_ИзменениеСтатусовИТР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ИзменениеСтатусовИТР</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИТР</name>
    <type>
      <types>CatalogRef.абс_ИТР</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыИТР</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыИТР/абс_СтатусыИТР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыИТР</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>Обработка</name>
  </enumValues>
  <enumValues>
    <name>НазначениеИнженера</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПодразделенийКТТКХТТК</name>
  </enumValues>
  <enumValues>
    <name>Разработка</name>
  </enumValues>
  <enumValues>
    <name>РазработкаЗавершена</name>
  </enumValues>
  <enumValues>
    <name>ИмплементацияИмплементацияОтменена</name>
  </enumValues>
  <enumValues>
    <name>ИмплементацияЗавершена</name>
  </enumValues>
  <enumValues>
    <name>ЗапрошенаПриостановка</name>
  </enumValues>
  <enumValues>
    <name>Приостановка</name>
  </enumValues>
  <enumValues>
    <name>ПереназначениеИнженера</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДиректоров</name>
  </enumValues>
  <enumValues>
    <name>Утверждение</name>
  </enumValues>
  <enumValues>
    <name>Имплементация</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
  <enumValues>
    <name>ЗакончилсяСрокЖизниИТР</name>
  </enumValues>
  <enumValues>
    <name>ИмплементацияОтменена</name>
  </enumValues>
  <enumValues>
    <name>ИмплементацияПриостановлена</name>
  </enumValues>
  <enumValues>
    <name>НТВ</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/абс_ИТР/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Инициатор = глЗначениеПеременной("глТекущийПользователь");
	
		ДатаРазмещения = ТекущаяДата();
		
		Статус = Перечисления.абс_СтатусыИТР.РазработкаЗавершена;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтатусПоРегистру = абс_БизнесПроцессы.ПолучитьСтатусИТРПоРегистру(Ссылка);
		
	Если НЕ Статус = СтатусПоРегистру ИЛИ НЕ ЗначениеЗаполнено(СтатусПоРегистру) Тогда
		ЗаписатьНовыйСтатус(Статус);		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьНовыйСтатус(НовыйСтатус, пКомментарий = Неопределено) Экспорт
	
	НаборЗаписей = РегистрыСведений.абс_ИзменениеСтатусовИТР.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.ИТР.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = ТекущаяДата();

	Запись.ИТР					= Ссылка;
	Запись.Пользователь	 		= глЗначениеПеременной("глТекущийПользователь");	
	Запись.Статус				= НовыйСтатус;
	
	Запись.Комментарий 			= пКомментарий;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
